# GetBuildResult Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
TessellatedShapeBuilder..::..GetBuildResult Method
TessellatedShapeBuilder Class See Also
---
Get the built geometry, build status and other data stored in TessellatedShapeBuilderResult. Clears the stored data.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public TessellatedShapeBuilderResult GetBuildResult()
```

Visual Basic
---
```text
Public Function GetBuildResult As TessellatedShapeBuilderResult
```

Visual C++
---
```text
public:
TessellatedShapeBuilderResult^ GetBuildResult()
```

# See Also
TessellatedShapeBuilder Class
Autodesk.Revit.DB Namespace